{"LWM2M":{"ATTR":{"xmlns:xsi":"http://www.w3.org/2001/XMLSchema-instance","xsi:noNamespaceSchemaLocation":"http://www.openmobilealliance.org/tech/profiles/LWM2M-v1_1.xsd"},"Object":[{"ATTR":{"ObjectType":"MODefinition"},"Name":["LwM2M Server"],"Description1":["This LwM2M Objects provides the data related to a LwM2M Server. A Bootstrap-Server has no such an Object Instance associated to it."],"ObjectID":["1"],"ObjectURN":["urn:oma:lwm2m:oma:1:1.2"],"LWM2MVersion":["1.2"],"ObjectVersion":["1.2"],"MultipleInstances":["Multiple"],"Mandatory":["Mandatory"],"Resources":[{"Item":[{"ATTR":{"ID":"0"},"Name":["Short Server ID"],"Operations":["R"],"MultipleInstances":["Single"],"Mandatory":["Mandatory"],"Type":["Integer"],"RangeEnumeration":["1..65534"],"Units":[""],"Description":["Used as link to associate server Object Instance."]},{"ATTR":{"ID":"1"},"Name":["Lifetime"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Mandatory"],"Type":["Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["Specify the lifetime of the registration in seconds (see Client Registration Interface). If the value is set to 0, the lifetime is infinite."]},{"ATTR":{"ID":"2"},"Name":["Default Minimum Period"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["The default value the LwM2M Client should use for the Minimum Period of an Observation in the absence of this parameter being included in an Observation.\r\nIf this Resource doesn’t exist, the default value is 0."]},{"ATTR":{"ID":"3"},"Name":["Default Maximum Period"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["The default value the LwM2M Client should use for the Maximum Period of an Observation in the absence of this parameter being included in an Observation."]},{"ATTR":{"ID":"4"},"Name":["Disable"],"Operations":["E"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":[""],"RangeEnumeration":[""],"Units":[""],"Description":["If this Resource is executed, this LwM2M Server Object is disabled for a certain period defined in the Disabled Timeout Resource. After receiving \"Execute\" operation, LwM2M Client MUST send response of the operation and perform de-registration process, and underlying network connection between the Client and Server MUST be disconnected to disable the LwM2M Server account.\r\nAfter the above process, the LwM2M Client MUST NOT send any message to the Server and ignore all the messages from the LwM2M Server for the period."]},{"ATTR":{"ID":"5"},"Name":["Disable Timeout"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["A period to disable the Server. After this period, the LwM2M Client MUST perform registration process to the Server. If this Resource is not set, a default timeout value is 86400 (1 day)."]},{"ATTR":{"ID":"6"},"Name":["Notification Storing When Disabled or Offline"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Mandatory"],"Type":["Boolean"],"RangeEnumeration":[""],"Units":[""],"Description":["If true, the LwM2M Client stores \"Notify\" operations to the LwM2M Server while the LwM2M Server account is disabled or the LwM2M Client is offline. After the LwM2M Server account is enabled or the LwM2M Client is online, the LwM2M Client reports the stored \"Notify\" operations to the Server.\r\nIf false, the LwM2M Client discards all the \"Notify\" operations or temporarily disables the Observe function while the LwM2M Server is disabled or the LwM2M Client is offline.\r\nThe default value is true.\r\nThe maximum number of storing Notifications per Server is up to the implementation."]},{"ATTR":{"ID":"7"},"Name":["Binding"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Mandatory"],"Type":["String"],"RangeEnumeration":[""],"Units":[""],"Description":["The possible values are those listed in the LwM2M Core Specification. This Resource defines the transport binding configured for the LwM2M Client.\r\nIf the LwM2M Client supports the binding specified in this Resource, the LwM2M Client MUST use that transport for the Current Binding Mode."]},{"ATTR":{"ID":"8"},"Name":["Registration Update Trigger"],"Operations":["E"],"MultipleInstances":["Single"],"Mandatory":["Mandatory"],"Type":[""],"RangeEnumeration":[""],"Units":[""],"Description":["If this Resource is executed the LwM2M Client MUST perform an \"Update\" operation with this LwM2M Server. The LwM2M Client can use a transport binding supported in the Current Binding Mode, Preferred Transport resource or the transport specified as an argument in the Registration Update Trigger."]},{"ATTR":{"ID":"9"},"Name":["Bootstrap-Request Trigger"],"Operations":["E"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":[""],"RangeEnumeration":[""],"Units":[""],"Description":["When this Resource is executed the LwM2M Client MUST initiate a \"Client Initiated Bootstrap\" procedure in using the LwM2M Bootstrap-Server Account."]},{"ATTR":{"ID":"10"},"Name":["APN Link"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Objlnk"],"RangeEnumeration":[""],"Units":[""],"Description":["If this resource is defined, it provides a link to the APN connection profile Object Instance (OMNA registered Object ID:11) to be used to communicate with this server."]},{"ATTR":{"ID":"11"},"Name":["TLS-DTLS Alert Code"],"Operations":["R"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":["0..255"],"Units":[""],"Description":["If this resource is defined, it contains the most recent TLS / DTLS alert message received from the LwM2M Server respective represented by the AlertDescription defined in Section 7.2 of RFC 5246. This resource set by the LwM2M Client may help the LwM2M Bootstrap-Server to determine the cause of TLS/DTLS connection failure with the respective LwM2M Server."]},{"ATTR":{"ID":"12"},"Name":["Last Bootstrapped"],"Operations":["R"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Time"],"RangeEnumeration":[""],"Units":[""],"Description":["If this resource is defined, it represents the last time that the bootstrap server updated this LwM2M Server Account. The LwM2M Client is responsible for updating this value. When the Bootstrap Server detects that this LwM2M Server Account is \"out-of-date\", the Bootstrap Server can update the LwM2M Server Account as represented by the LwM2M Server object instance."]},{"ATTR":{"ID":"13"},"Name":["Registration Priority Order"],"Operations":["R"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":[""],"Units":[""],"Description":["The LwM2M Client sequences the LwM2M Server registrations in increasing order of this value. If this value is not defined, registration attempts to this server are not impacted by other server registrations."]},{"ATTR":{"ID":"14"},"Name":["Initial Registration Delay Timer"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["The delay, in seconds, before registration is attempted for this LwM2M Server based upon the completion of registration of the previous LwM2M Server in the registration order. This is only applied until the first successful registration after a successful bootstrapping sequence."]},{"ATTR":{"ID":"15"},"Name":["Registration Failure Block"],"Operations":["R"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Boolean"],"RangeEnumeration":[""],"Units":[""],"Description":["When set to true and registration to this LwM2M server fails, the LwM2M Client blocks registration to other servers in the order. When set to false, the LwM2M Client proceeds with registration to the next server in the order."]},{"ATTR":{"ID":"16"},"Name":["Bootstrap on Registration Failure"],"Operations":["R"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Boolean"],"RangeEnumeration":[""],"Units":[""],"Description":["If set to true, this indicates that the LwM2M Client should re-bootstrap when either registration is explicitly rejected by the LwM2M Server or registration is considered as failing as dictated by the other resource settings. If set to false, the LwM2M Client will continue with the registration attempts as dictated by the other resource settings."]},{"ATTR":{"ID":"17"},"Name":["Communication Retry Count"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":[""],"Units":[""],"Description":["The number of successive communication attempts before which a communication sequence is considered as failed."]},{"ATTR":{"ID":"18"},"Name":["Communication Retry Timer"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["The delay, in seconds, between successive communication attempts in a communication sequence. This value is multiplied by two to the power of the communication retry attempt minus one (2**(retry attempt-1)) to create an exponential back-off."]},{"ATTR":{"ID":"19"},"Name":["Communication Sequence Delay Timer"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":[""],"Units":["s"],"Description":["The delay, in seconds, between successive communication sequences. A communication sequence is defined as the exhaustion of the Communication Retry Count and Communication Retry Timer values. A communication sequence can be applied to server registrations or bootstrapping attempts. MAX_VALUE means do not perform another communication sequence."]},{"ATTR":{"ID":"20"},"Name":["Communication Sequence Retry Count"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":[""],"Units":[""],"Description":["The number of successive communication sequences before which a registration attempt is considered as failed."]},{"ATTR":{"ID":"21"},"Name":["Trigger"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Boolean"],"RangeEnumeration":[""],"Units":[""],"Description":["Using the Trigger Resource a LwM2M Client can indicate whether it is reachable over SMS (value set to 'true') or not (value set to 'false'). The default value (resource not present) is 'false'. When set to 'true' the LwM2M Server MAY, for example, request the LwM2M Client to perform operations, such as the \"Update\" operation by sending an \"Execute\" operation on \"Registration Update Trigger\" Resource via SMS. No SMS response is expected for such a message."]},{"ATTR":{"ID":"22"},"Name":["Preferred Transport"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["String"],"RangeEnumeration":["The possible values are those listed in the LwM2M Core Specification"],"Units":[""],"Description":["Only a single transport binding SHALL be present. When the LwM2M client supports multiple transports, it MAY use this transport to initiate a connection. This resource can also be used to switch between multiple transports e.g. a non-IP device can switch to UDP transport to perform firmware updates."]},{"ATTR":{"ID":"23"},"Name":["Mute Send"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Boolean"],"RangeEnumeration":[""],"Units":[""],"Description":["If true or the Resource is not present, the LwM2M Client Send command capability is de-activated. \r\nIf false, the LwM2M Client Send Command capability is activated."]},{"ATTR":{"ID":"24"},"Name":["Alternate APN Links"],"Operations":["RW"],"MultipleInstances":["Multiple"],"Mandatory":["Optional"],"Type":["Objlnk"],"RangeEnumeration":[""],"Units":[""],"Description":["If this resource is defined, it provides links to alternate APN connection profile Object Instance (OMNA registered Object ID:11) to be used to communicate with this server if Resource 10 has configuration conflicts."]},{"ATTR":{"ID":"25"},"Name":["Supported Server Versions"],"Operations":["RW"],"MultipleInstances":["Multiple"],"Mandatory":["Optional"],"Type":["String"],"RangeEnumeration":[""],"Units":[""],"Description":["This resource provides the supported enabler versions of the server to the client as a set of strings. Format for each string is 1*DIGIT\".\"1*DIGIT\".\"1*DIGIT where the third DIGIT is optional."]},{"ATTR":{"ID":"26"},"Name":["Default Notification Mode"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Integer"],"RangeEnumeration":["0..1"],"Units":[""],"Description":["This resource indicates the default mode for observations to be sent: 0 = Non-Confirmable, 1 = Confirmable."]},{"ATTR":{"ID":"27"},"Name":["Profile ID Hash Algorithm"],"Operations":["RW"],"MultipleInstances":["Single"],"Mandatory":["Optional"],"Type":["Unsigned Integer"],"RangeEnumeration":["0..255"],"Units":[""],"Description":["If this resource is defined, it contains the hash algorithm the LwM2M Server would prefer the LwM2M Client to use with the dynamically generated mode of creating Profile IDs. The numerical ID value of the 'Suite Identifiers' registered by RFC 6920 is used in this Resource."]}]}],"Description2":[""]}]}}